---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentEntryPoint..::..GetRoomAtPoint Method
DocumentEntryPoint Class See Also Send Feedback
---

Gets a room containing the point.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetRoomAtPoint(XYZ) | Gets a room containing the point. (Inherited from Document.) |
|  | GetRoomAtPoint(XYZ, Phase) | Gets a room containing the point. (Inherited from Document.) |

# See Also

DocumentEntryPoint Class

DocumentEntryPoint Members

Autodesk.Revit.DB.Macros Namespace